Ran Apply for project: `apps` dir: `terragrunt-integration/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>> APPLYING WITH TERRAGRUNT <<<<

23:20:36.230 INFO   The runner at . will be processed in the following order for command apply:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


23:20:36.387 STDOUT terraform: Terraform used the selected providers to generate the following execution
23:20:36.387 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
23:20:36.387 STDOUT terraform:   + create
23:20:36.387 STDOUT terraform: Terraform will perform the following actions:
23:20:36.387 STDOUT terraform:   # random_string.base_bucket_name will be created
23:20:36.387 STDOUT terraform:   + resource "random_string" "base_bucket_name" {
23:20:36.387 STDOUT terraform:       + id          = (known after apply)
23:20:36.387 STDOUT terraform:       + length      = 4
23:20:36.387 STDOUT terraform:       + lower       = true
23:20:36.387 STDOUT terraform:       + min_lower   = 0
23:20:36.387 STDOUT terraform:       + min_numeric = 0
23:20:36.387 STDOUT terraform:       + min_special = 0
23:20:36.387 STDOUT terraform:       + min_upper   = 0
23:20:36.387 STDOUT terraform:       + number      = false
23:20:36.387 STDOUT terraform:       + numeric     = false
23:20:36.387 STDOUT terraform:       + result      = (known after apply)
23:20:36.387 STDOUT terraform:       + special     = false
23:20:36.387 STDOUT terraform:       + upper       = false
23:20:36.387 STDOUT terraform:     }
23:20:36.387 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:20:36.387 STDOUT terraform: 
23:20:36.387 STDOUT terraform: Changes to Outputs:
23:20:36.387 STDOUT terraform:   + base_bucket_name = (known after apply)
23:20:36.389 STDOUT [modules/random] terraform: Terraform used the selected providers to generate the following execution
23:20:36.389 STDOUT [modules/random] terraform: plan. Resource actions are indicated with the following symbols:
23:20:36.389 STDOUT [modules/random] terraform:   + create
23:20:36.389 STDOUT [modules/random] terraform: Terraform will perform the following actions:
23:20:36.389 STDOUT [modules/random] terraform:   # random_string.base_bucket_name will be created
23:20:36.389 STDOUT [modules/random] terraform:   + resource "random_string" "base_bucket_name" {
23:20:36.389 STDOUT [modules/random] terraform:       + id          = (known after apply)
23:20:36.389 STDOUT [modules/random] terraform:       + length      = 4
23:20:36.389 STDOUT [modules/random] terraform:       + lower       = true
23:20:36.389 STDOUT [modules/random] terraform:       + min_lower   = 0
23:20:36.389 STDOUT [modules/random] terraform:       + min_numeric = 0
23:20:36.389 STDOUT [modules/random] terraform:       + min_special = 0
23:20:36.389 STDOUT [modules/random] terraform:       + min_upper   = 0
23:20:36.389 STDOUT [modules/random] terraform:       + number      = false
23:20:36.390 STDOUT [modules/random] terraform:       + numeric     = false
23:20:36.390 STDOUT [modules/random] terraform:       + result      = (known after apply)
23:20:36.390 STDOUT [modules/random] terraform:       + special     = false
23:20:36.390 STDOUT [modules/random] terraform:       + upper       = false
23:20:36.390 STDOUT [modules/random] terraform:     }
23:20:36.390 STDOUT [modules/random] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:20:36.390 STDOUT [modules/random] terraform: 
23:20:36.390 STDOUT [modules/random] terraform: Changes to Outputs:
23:20:36.390 STDOUT [modules/random] terraform:   + base_bucket_name = (known after apply)
23:20:36.420 STDOUT terraform: random_string.base_bucket_name: Creating...
23:20:36.422 STDOUT terraform: random_string.base_bucket_name: Creation complete after 0s [id=mqxm]
23:20:36.422 STDOUT [modules/random] terraform: random_string.base_bucket_name: Creating...
23:20:36.425 STDOUT [modules/random] terraform: random_string.base_bucket_name: Creation complete after 0s [id=rfie]
23:20:36.431 STDOUT terraform: 
23:20:36.431 STDOUT terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:20:36.431 STDOUT terraform: 
23:20:36.431 STDOUT terraform: Outputs:
23:20:36.431 STDOUT terraform: base_bucket_name = "mqxm"
23:20:36.433 STDOUT [modules/random] terraform: 
23:20:36.433 STDOUT [modules/random] terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:20:36.433 STDOUT [modules/random] terraform: 
23:20:36.433 STDOUT [modules/random] terraform: Outputs:
23:20:36.433 STDOUT [modules/random] terraform: base_bucket_name = "rfie"
Are you sure you want to run 'terragrunt apply' in each unit of the run queue displayed above? (y/n) 23:20:36.438 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/iYaPT4K8tbWzadJhMTwxpYwRHco/XMdilrBjMFEt6VJsCq2lLBPXRyU
23:20:36.460 INFO   terraform: Initializing the backend...
23:20:36.471 INFO   terraform: Initializing provider plugins...
23:20:36.471 INFO   terraform: - Reusing previous version of hashicorp/random from the dependency lock file
23:20:37.148 INFO   terraform: - Using previously-installed hashicorp/random v3.7.2
23:20:37.148 INFO   terraform: Terraform has been successfully initialized!
23:20:37.148 INFO   terraform: 
23:20:37.148 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
23:20:37.148 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
23:20:37.148 INFO   terraform: should now work.
23:20:37.148 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
23:20:37.148 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
23:20:37.148 INFO   terraform: commands will detect it and remind you to do so if necessary.
23:20:40.058 STDOUT [app1] terraform: Terraform used the selected providers to generate the following execution
23:20:40.058 STDOUT [app1] terraform: plan. Resource actions are indicated with the following symbols:
23:20:40.058 STDOUT [app1] terraform:   + create
23:20:40.058 STDOUT [app1] terraform: Terraform will perform the following actions:
23:20:40.058 STDOUT [app1] terraform:   # aws_s3_bucket.this will be created
23:20:40.058 STDOUT [app1] terraform:   + resource "aws_s3_bucket" "this" {
23:20:40.058 STDOUT [app1] terraform:       + acceleration_status         = (known after apply)
23:20:40.058 STDOUT [app1] terraform:       + acl                         = "private"
23:20:40.058 STDOUT [app1] terraform:       + arn                         = (known after apply)
23:20:40.058 STDOUT [app1] terraform:       + bucket                      = "app1-new9-dev-rfie"
23:20:40.058 STDOUT [app1] terraform:       + bucket_domain_name          = (known after apply)
23:20:40.058 STDOUT [app1] terraform:       + bucket_prefix               = (known after apply)
23:20:40.058 STDOUT [app1] terraform:       + bucket_regional_domain_name = (known after apply)
23:20:40.058 STDOUT [app1] terraform:       + force_destroy               = false
23:20:40.058 STDOUT [app1] terraform:       + hosted_zone_id              = (known after apply)
23:20:40.058 STDOUT [app1] terraform:       + id                          = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + object_lock_enabled         = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + policy                      = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + region                      = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + request_payer               = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + tags_all                    = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + website_domain              = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + website_endpoint            = (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + cors_rule (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + grant (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + lifecycle_rule (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + logging (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + object_lock_configuration (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + replication_configuration (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + server_side_encryption_configuration (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + versioning (known after apply)
23:20:40.059 STDOUT [app1] terraform:       + website (known after apply)
23:20:40.059 STDOUT [app1] terraform:     }
23:20:40.059 STDOUT [app1] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:20:40.059 STDOUT [app1] terraform: 
23:20:40.059 STDOUT [app1] terraform: Changes to Outputs:
23:20:40.059 STDOUT [app1] terraform:   + bucket_arn = (known after apply)
23:20:40.132 STDOUT [app2] terraform: Terraform used the selected providers to generate the following execution
23:20:40.132 STDOUT [app2] terraform: plan. Resource actions are indicated with the following symbols:
23:20:40.132 STDOUT [app2] terraform:   + create
23:20:40.132 STDOUT [app2] terraform: Terraform will perform the following actions:
23:20:40.132 STDOUT [app2] terraform:   # aws_s3_bucket.this will be created
23:20:40.132 STDOUT [app2] terraform:   + resource "aws_s3_bucket" "this" {
23:20:40.132 STDOUT [app2] terraform:       + acceleration_status         = (known after apply)
23:20:40.132 STDOUT [app2] terraform:       + acl                         = "private"
23:20:40.132 STDOUT [app2] terraform:       + arn                         = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + bucket                      = "app2-dev-rfie"
23:20:40.133 STDOUT [app2] terraform:       + bucket_domain_name          = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + bucket_prefix               = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + bucket_regional_domain_name = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + force_destroy               = false
23:20:40.133 STDOUT [app2] terraform:       + hosted_zone_id              = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + id                          = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + object_lock_enabled         = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + policy                      = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + region                      = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + request_payer               = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + tags_all                    = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + website_domain              = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + website_endpoint            = (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + cors_rule (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + grant (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + lifecycle_rule (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + logging (known after apply)
23:20:40.133 STDOUT [app2] terraform:       + object_lock_configuration (known after apply)
23:20:40.134 STDOUT [app2] terraform:       + replication_configuration (known after apply)
23:20:40.134 STDOUT [app2] terraform:       + server_side_encryption_configuration (known after apply)
23:20:40.134 STDOUT [app2] terraform:       + versioning (known after apply)
23:20:40.134 STDOUT [app2] terraform:       + website (known after apply)
23:20:40.134 STDOUT [app2] terraform:     }
23:20:40.134 STDOUT [app2] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:20:40.134 STDOUT [app2] terraform: 
23:20:40.134 STDOUT [app2] terraform: Changes to Outputs:
23:20:40.134 STDOUT [app2] terraform:   + bucket_arn = (known after apply)
23:20:40.925 STDOUT [app1] terraform: aws_s3_bucket.this: Creating...
23:20:40.967 STDOUT [app2] terraform: aws_s3_bucket.this: Creating...
23:20:44.100 STDOUT [app2] terraform: aws_s3_bucket.this: Creation complete after 3s [id=app2-dev-rfie]
23:20:44.117 STDOUT [app2] terraform: ╷
23:20:44.117 STDOUT [app2] terraform: │ Warning: Argument is deprecated
23:20:44.117 STDOUT [app2] terraform: │ 
23:20:44.117 STDOUT [app2] terraform: │   with aws_s3_bucket.this,
23:20:44.117 STDOUT [app2] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:20:44.117 STDOUT [app2] terraform: │   17:   acl    = "private"
23:20:44.117 STDOUT [app2] terraform: │ 
23:20:44.117 STDOUT [app2] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:20:44.117 STDOUT [app2] terraform: │ 
23:20:44.117 STDOUT [app2] terraform: │ (and 2 more similar warnings elsewhere)
23:20:44.117 STDOUT [app2] terraform: ╵
23:20:44.117 STDOUT [app2] terraform: 
23:20:44.117 STDOUT [app2] terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:20:44.117 STDOUT [app2] terraform: 
23:20:44.117 STDOUT [app2] terraform: Outputs:
23:20:44.117 STDOUT [app2] terraform: bucket_arn = "arn:aws:s3:::app2-dev-rfie"
23:20:44.195 STDOUT [app1] terraform: aws_s3_bucket.this: Creation complete after 3s [id=app1-new9-dev-rfie]
23:20:44.214 STDOUT [app1] terraform: ╷
23:20:44.215 STDOUT [app1] terraform: │ Warning: Argument is deprecated
23:20:44.215 STDOUT [app1] terraform: │ 
23:20:44.215 STDOUT [app1] terraform: │   with aws_s3_bucket.this,
23:20:44.215 STDOUT [app1] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:20:44.215 STDOUT [app1] terraform: │   17:   acl    = "private"
23:20:44.215 STDOUT [app1] terraform: │ 
23:20:44.215 STDOUT [app1] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:20:44.215 STDOUT [app1] terraform: │ 
23:20:44.215 STDOUT [app1] terraform: │ (and 2 more similar warnings elsewhere)
23:20:44.215 STDOUT [app1] terraform: ╵
23:20:44.215 STDOUT [app1] terraform: 
23:20:44.215 STDOUT [app1] terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:20:44.215 STDOUT [app1] terraform: 
23:20:44.215 STDOUT [app1] terraform: Outputs:
23:20:44.215 STDOUT [app1] terraform: bucket_arn = "arn:aws:s3:::app1-new9-dev-rfie"
```

</details>